backend/app/Models/EventLevelsModel.php

SELECT *
FROM `event_levels`
---
    public function getAllEventLevels()
    {
        return $this->findAll(); // Use Model's `findAll()` to get all records