backend/app/Models/EventsModel.php

    public function getEventsByRoomIdsAndStatus($roomIds)
    {
        // Extract only the 'id' values from the roomIds array
        $roomIdsArray = array_map(function($room) {
            return $room['id'];  // Assuming room has an 'id' key
        }, $roomIds);

        // Build the query with the room IDs
        $query = $this->db->table('events')
                        ->select('events.*, notification.accepted_rejected, CONCAT(teachers.firstName, " ", teachers.lastName) as teacher_name,teachers.email as teacher_email,eventtypes.eventType,rooms.room_no,events.event_level_id,event_levels.event_level,events.eligible_dept,departments.dept_name')
                        ->join('notification', 'events.id = notification.event_id', 'left')
                        ->join('event_levels', 'events.event_level_id = event_levels.id', 'left')
                        ->join('eventtypes', 'eventtypes.id = events.eventType_id','left')
                        ->join('departments', 'departments.id = events.dept')
                        ->join('rooms', 'rooms.id = events.room_id')
                        ->join('teachers', 'teachers.id = events.teacher_id')
                        ->whereIn('events.room_id', $roomIdsArray)
                        ->where('events.event_status', 0)
                        ->where('notification.accepted_rejected', null);

        return $query->get()->getResult();
---
SELECT `events`.*, `notification`.`accepted_rejected`, CONCAT(teachers.firstName, " ", teachers.lastName) as teacher_name, `teachers`.`email` as `teacher_email`, `eventtypes`.`eventType`, `rooms`.`room_no`, `events`.`event_level_id`, `event_levels`.`event_level`
FROM `events`
LEFT JOIN `notification` ON `events`.`id` = `notification`.`event_id`
LEFT JOIN `event_levels` ON `events`.`event_level_id` = `event_levels`.`id`
LEFT JOIN `eventtypes` ON `eventtypes`.`id` = `events`.`eventType_id`
JOIN `rooms` ON `rooms`.`id` = `events`.`room_id`
JOIN `teachers` ON `teachers`.`id` = `events`.`teacher_id`
WHERE `events`.`room_id` IN ('1','2','3','4','5','6')
AND `events`.`event_status` = 0
AND `notification`.`accepted_rejected` IS NULL
SELECT `events`.*, `notification`.`accepted_rejected`, CONCAT(teachers.firstName, " ", teachers.lastName) as teacher_name, `teachers`.`email` as `teacher_email`, `eventtypes`.`eventType`, `rooms`.`room_no`, `events`.`event_level_id`, `event_levels`.`event_level`, `events`.`eligible_dept`, `departments`.`dept_name`
FROM `events`
LEFT JOIN `notification` ON `events`.`id` = `notification`.`event_id`
LEFT JOIN `event_levels` ON `events`.`event_level_id` = `event_levels`.`id`
LEFT JOIN `eventtypes` ON `eventtypes`.`id` = `events`.`eventType_id`
JOIN `departments` ON `departments`.`id` = `events`.`dept`
JOIN `rooms` ON `rooms`.`id` = `events`.`room_id`
JOIN `teachers` ON `teachers`.`id` = `events`.`teacher_id`
WHERE `events`.`room_id` IN ('1','2','3','4','5','6')
AND `events`.`event_status` = 0
AND `notification`.`accepted_rejected` IS NULL