backend/app/Models/EventsRegistrationModel.php

    public function getRegistrationsByStudent($studentId)
    {
        // Join the registration table with the events and eventtypes tables
        $builder = $this->db->table($this->table);
        $builder->select('registration.*, events.*, eventtypes.eventType'); // Include eventType from eventtypes table
        $builder->join('events', 'registration.event_id = events.id', 'left'); // Join on event_id
        $builder->join('eventtypes', 'eventtypes.id = events.eventType_id', 'left'); // Join eventtypes on eventType_id
        $builder->where('registration.student_id', $studentId); // Filter by student ID
        $builder->orderBy('events.start_date', 'DESC'); // Order by start_date descending
        $builder->orderBy('events.end_date', 'DESC'); // Order by end_date descending

        return $builder->get()->getResultArray(); // Fetch results as an array
---
SELECT `registration`.*, `events`.*, `eventtypes`.`eventType`
FROM `registration`
LEFT JOIN `events` ON `registration`.`event_id` = `events`.`id`
LEFT JOIN `eventtypes` ON `eventtypes`.`id` = `events`.`eventType_id`
WHERE `registration`.`student_id` = '40'
ORDER BY `events`.`start_date` DESC, `events`.`end_date` DESC