backend/app/Models/NotificationModel.php

    public function getNotificationsByRequestedBy($requested_by)
    {
        // Join notifications with events to fetch event details
        return $this->select('notification.*, events.event_name')
                    ->join('events', 'events.id = notification.event_id')
                    ->where('notification.requested_by', $requested_by)
                    ->where('notification.display_status', 1)
                    ->orderBy('notification.created_at', 'DESC') // Order by created_at in descending order (most recent first)
                    ->findAll();
---
SELECT `notification`.*, `events`.`event_name`
FROM `notification`
JOIN `events` ON `events`.`id` = `notification`.`event_id`
WHERE `notification`.`requested_by` = '42'
AND `notification`.`display_status` = 1
ORDER BY `notification`.`created_at` DESC