backend/app/Models/RoomsModel.php

SELECT `id`
FROM `rooms`
WHERE `room_owner` = '17'
---
    public function getRoomIdsByOwner($room_owner_id)
    {
        return $this->select('id')
                    ->where('room_owner', $room_owner_id)
                    ->findAll();