backend/app/Models/StudentsModel.php

SELECT `students`.*, `departments`.`dept_name`, `colleges`.`college`
FROM `students`
LEFT JOIN `departments` ON `students`.`dept_id` = `departments`.`id`
LEFT JOIN `colleges` ON `students`.`college_id` = `colleges`.`id`
WHERE `students`.`id` = '34'
---
    public function getStudentById($id)
    {
        $db = \Config\Database::connect();
        $builder = $db->table($this->table);

        $builder->select('
            students.*,
            departments.dept_name,
            colleges.college, degree.degree');
            $builder->join('departments', 'students.dept_id = departments.id', 'left');
        $builder->join('colleges', 'students.college_id = colleges.id', 'left');
        $builder->join('degree', 'departments.degree_id = degree.id', 'left');
        $builder->where('students.id', $id);

        $query = $builder->get();

UPDATE `students` SET `skills` = 'Python'
WHERE `students`.`id` IN ('34')
---
    public function subscribeByEmail($email)
    {
        $db = \Config\Database::connect();
        $builder = $db->table('students');

        // Update the 'subscribe' attribute to 1 where the email matches
        $builder->set('subscribe', 1);
        $builder->where('email', $email);
        $builder->update();