backend/app/Controllers/DegreeController.php

SELECT *
FROM `degree`
---
    public function getDegrees()
    {
        // Perform the database query directly in the controller
        $builder = $this->db->table('degree');
        $degrees = $builder->get()->getResult();