backend/app/Controllers/EventsController.php

SELECT *
FROM `departments`
WHERE `id` IN ('')
---
    public function getEventByRoomOwner($room_owner_id)
    {


        // Step 1: Get all room ids where room_owner matches the passed room_owner_id
        $roomIds = $this->roomsModel->getRoomIdsByOwner($room_owner_id);

        // Step 2: Get events based on room_ids with event_status = 0
        $events = $this->eventsModel->getEventsByRoomIdsAndStatus($roomIds);
         // Initialize the DepartmentModel
         $this->departmentsModel = new \App\Models\DepartmentModel();

         // Map the eligible_dept to department names
         foreach ($events as &$event) {
             $eligibleDeptIds = explode(',', $event->eligible_dept); // Convert eligible_dept to an array of IDs
             $deptNames = [];

             if (!empty($eligibleDeptIds)) {
                 // Fetch department names
                 $departments = $this->departmentsModel->whereIn('id', $eligibleDeptIds)->findAll();