backend/app/Controllers/EventTypesController.php

SELECT *
FROM `eventtypes`
---
    public function index()
    {

        // Create an instance of the EventTypeModel
        $eventTypeModel = new EventTypeModel();

        // Fetch all data from the 'eventtypes' table
        $eventTypes = $eventTypeModel->findAll();