backend/app/Controllers/RegistrationController.php

        $studentModel = new StudentsModel();

        // Check if the email already exists in the students table
        $studentExists = $studentModel->where('email', $email)->first();
---
SELECT *
FROM `students`
WHERE `email` = 'k@gmail.com'
 LIMIT 1

        }

        // Insert the student's details into the database
        $studentModel->insert([
            'firstName' => $firstName,
            'lastName' => $lastName,
            'student_id' => $registerNumber,
            'email' => $email,
            'password' => $hashedPassword,
            'dept_id' => $dept_id,
            'phone' => $phone,
            'gender' => $gender,
            'college_id' => $college_id
        ]);
---
INSERT INTO `students` (`firstName`, `lastName`, `student_id`, `email`, `password`, `dept_id`, `phone`, `gender`, `college_id`) VALUES ('kanna', 'some', '21501a05g7', 'k@gmail.com', '123', '1', '9658324152', 'F', '1')

public function login()
    {
        $data = $this->request->getJSON(true);
        $email = $data['email'];
        $password = $data['password'];

        $studentModel = new StudentsModel();
        $teacherModel = new TeachersModel();
        $sessionModel = new SessionsModel();

        try {
            // Check Teachers Table
            $teacher = $teacherModel->where('email', $email)->first();
---
SELECT *
FROM `teachers`
WHERE `email` = 'bg@gmail.com'
 LIMIT 1

            }

            // Check Students Table
            $student = $studentModel->where('email', $email)->first();
---
SELECT *
FROM `students`
WHERE `email` = 'bg@gmail.com'
 LIMIT 1

        }

        // Determine if the user is a teacher or student
        $user = $teacherModel->where('teacher_id', $session['user_id'])->first() ?? $studentModel->where('student_id', $session['user_id'])->first();
---
SELECT *
FROM `students`
WHERE `student_id` = '21501A05A2'
 LIMIT 1
SELECT *
FROM `teachers`
WHERE `teacher_id` = '21501A05A2'
 LIMIT 1